["The hospital has a commitment to provide the best possible medical care.", "Our farm only sells fresh local produce.", "What are you trying to prove?", "Prove yourself!", "You deserve a reward for being so helpful.", "Children must be accompanied by an adult.", "I admired him as a true scientist and hard work.", "I'm looking forword to seeing your perform.", "He'll get over it—young people are amazingly resilient.", "He is really angry at this customer and I can't blame him, I wound be angry too.", "We definitely like free things.", "I think that this guy was a lot of more casual than the place he was in.", "That cough was just a little too much.", "It seemed like she was acting.", "He has neither the policies [ˈpɑːləsiz] nor the personal charisma [kəˈrɪzmə] to insprire people.", "He admitted all his mistakes.", "there's no way is another way of saying  'it is impossible'", "I have another phrase for you as well", "I think it's okay when a pregnant woman cuts in line.", "somebody's gonna say something and probably end up in a fight.", "It was a pleasure [ˈpleʒər].", "we're gonna give you some real English to talk about travel.", "you would use in everyday life, that you hear in movies, in TV shows", "That sounds a little bit complicated.", "Everything you need is inside the car.", "Put gas in the gas tank.", "Make a pit stop.", "a quick stop", "We've got all our bases covered.", "hurricane hits", "After ten minutes we promise you will understand everything in this lesson.", "I have another meeting in twenty minutes, so, let's get down to business.", "I can't get rid [rɪd] of this headache.", "They intend to sue for damages [ˈdæmɪdʒɪz].", "I don't intend staying long.", "I'm really looking forward to today's lesson.", "I completely [kəmˈpliːtli] understand this guy.", "I'm can't find the street, are you sure this map is up to date?", "Sarah has just finished the report and all the information is up to date.", "this is a new map, this the most up to date map.", "we're ready to listen to our dialogue a third time, It'll be at the normal speed.", "Just give a second. I'll be right up.", "I'll be right there.", "I'll be right down!", "I'll be right out!", "Just a minute! I'll be right out!", "Frank didn't come to work today and it turns out that he was sick.", "I've been feeling really sick recently.", "I'm just kidding", "His computer was acting strangely.", "His computer isn't working properly['prɔpəli].", "it's acting up.", "It sounds really natural [ˈnætʃrəl].", "Really? How come?", "It shuts down by itself. That sounds like a virus.", "so stay tuned [tju:nd] for our next great lesson.", "so people can get touch with you, can phone you or email you .", "slip my mind", "be more fluent by knowing how phrases together", "is there a bake around here?", "that means some little bit different", "there is a great restaurant around corner.", "HangZhou is a great city, I used to live around there.", "I'm terrible with names too.", "I'm terrible with directions, I always get lost.", "I'm terrible with faces, I can never remember people look like.", "we should definitely meet up again and continue our discussion.", "Don't worry about it, it happens to me all the time.", "so it's clear now, you can understand a lot better.", "speaking of movies, today's podcast takes place at the movies.", "They're not thinking about the feelings of other people.", "An old lady was standing there and no one got up to give her their seat.", "Excuse me, do you mind keeping it down? It's after midnight.", "I hate it when people's phones ring when I'm watching a movie.", "I think everyone gets kind of angry.", "I can't get these files due by tomorrow.", "I'm gonna be ten minutes late for the meeting.", "Switch the TV off!", "Switch off the TV!", "I think this one is a little bit hard, let's look at a couple more examples.", "Do you mind holding my coat for me?", "Oh, I forgot my wallet [ˈwɑːlɪt]. Do you mind paying for dinner?", "But depending on your voice and how you use your tone.", "would you mind, do you mind are very polite phrases.", "it could be a little bit rude, if you say \"would you mind keeping it down?\"", "Yeah, exactly, I mean in English you have to be careful, because your tone of voice tells the other person how you're feeling; if you're angry, sad or...just like in any other language.", "it'll be at its normal speed.", "So, I know that in different countries there're different habits [ˈhæbɪt] about watching movies", "I imagine it is", "it's not really uncommon depending on the city, um, to find people bringing in chicken or some sort of like really smelly food.", "You know, I used to live in Switzerland and in Switzerland you would have to eat before you watch the movie. There was no popcorn, no soda, no candy inside the movie theater. Can you imagine that?", "The whole purpose of going to the movies is to have some popcorn and relax and have a good time.", "for making suggestions and for responding to suggestions", "we can start off by looking at the first one.", "Drive sales = To increase sales = to sell more.", "job promotion", "we're talking about a marketing strategy", "if I go to the supermarket and I see “Buy one and get one free\",  that's two-for-one.", "Perhaps the shampoo in the supermarket is less expensive than usual.", "usually, maybe it costs five dollars, but today it costs four dollars, that's a sales promotion.", "It's gonna be pretty fast, so it might be a little bit difficult to understand.", "Do you think we can match our competitors' prices and still keep our quality high?", "I see that match the competitors means to be as good as or better than other companies in the same industry.", "I totally agree.", "I'm pretty sure everyone has had a manger or a supervisor that's similar to this guy.", "If you're a manager, you want to motivate your employees.", "I think it's the most important thing a manger does is to encourage his or her employees and to help support them to grow and to be better people in the job.", "we've got language to help you to gossip better.", "You'll never guess what I saw!", "this is a common word you probably hear all the time in a lot of different satiations.", "Cause I don't have a home.", "You have to fill me in.", "basically you think something bad is gonna happen.", "that makes sense.", "It's you're pretty strict.", "also maybe you've kicked your husband out of bed.", "I'm kind of creeped out by clowns [klaʊnz].", "You scared the heck out of me.", "I don't know if you've heard.", "Oh, tell me about it.", "Give me the details", "but we don't know how it ends"]